import WeH2 from "./ui/weH2";

export default function FAQ() {
  const questionsAndAnswers = [
    {
      q: "כמה זמן לוקח תהליך עיצוב פנים?",
      a: "משך הזמן תלוי בסוג הפרויקט ובמורכבות שלו. עיצוב חלל קטן יכול לקחת מספר שבועות, בעוד פרויקטים גדולים יותר, כמו עיצוב בית פרטי שלם, עשויים להימשך מספר חודשים. אנחנו עובדים עם לוחות זמנים מסודרים ומעדכנים אתכם בכל שלב.",
    },
    {
      q: "האם הסטודיו עובד עם תקציבים מוגדרים?",
      a: "בהחלט! אנחנו מתאימות את תהליך העיצוב לתקציב שהוגדר מראש, תוך שמירה על איכות החומרים והתוצאה. חשוב לנו להפיק את המקסימום מכל תקציב ולוודא שאתם מרוצים.",
    },
    {
      q: "האם אני יכול/ה להיות מעורב/ת בתהליך העיצוב?",
      a: "כמובן! אנחנו מאמינות בשיתוף פעולה מלא עם הלקוחות שלנו. בכל שלב, מהתכנון הראשוני ועד בחירת הפריטים הסופית, אתם מוזמנים להביע דעה ולהיות חלק מהתהליך.",
    },
    {
      q: "האם הסטודיו מטפל גם בביצוע העבודה בשטח?",
      a: "כן, אנחנו מלוות אתכם לכל אורך הדרך, כולל פיקוח על העבודות בשטח. אנחנו עובדות עם אנשי מקצוע וספקים מנוסים כדי לוודא שהתוצאה הסופית תהיה מושלמת.",
    },
    {
      q: "האם אתם עוזרות גם בבחירת רהיטים ואקססוריז?",
      a: "בהחלט! בחירת רהיטים, תאורה, ואקססוריז היא חלק חשוב בתהליך. נלווה אתכם לסיורים בחנויות ונעזור לבחור את הפריטים המתאימים ביותר לסגנון ולתקציב שלכם.",
    },
  ];

  return (
    <section
      id="faq"
      className="main-container h-fit py-20 flex flex-col gap-10"
    >
      <WeH2 className="sm:text-center text-right">שאלות נפוצות</WeH2>
      <div className="flex flex-col gap-4 w-full sm:w-[70%] mx-auto" dir="rtl">
        {questionsAndAnswers.map((item, index) => {
          return (
            <details
              key={index}
              className="border-b-[0.5px] border-foreground pb-3 hover:cursor-pointer"
            >
              <summary className="text-right">{item.q}</summary>
              <p className="py-4">{item.a}</p>
            </details>
          );
        })}
      </div>
    </section>
  );
}
